from datetime import timedelta

#------------------------------------WEB设置-----------------------------------
#Web登录有效期 h
WEB_EXPIRATION_DATE   =24

#Web服务器地址服务端口，80是默认http端口
WEB_SERVER_PORT       =80



# ----------------------------------接口ip限制----------------------------------
# 设置请求时间窗口和最大请求次数
LOW_REQUEST_TIME_WINDOW = timedelta(seconds=30)
# 最大请求次数
LOW_MAX_REQUESTS        = 30


# 设置请求时间窗口和最大请求次数
MIN_REQUEST_TIME_WINDOW = timedelta(seconds=30)
# 最大请求次数
MIN_MAX_REQUESTS        = 10



# 设置请求时间窗口和最大请求次数
HIGN_REQUEST_TIME_WINDOW = timedelta(minutes=1)
# 最大请求次数
HIGN_MAX_REQUESTS        = 5



# 设置请求时间窗口和最大请求次数
HIGN_LONG_REQUEST_TIME_WINDOW = timedelta(minutes=30)
# 最大请求次数
HIGN_LONG_MAX_REQUESTS        = 10



#--------------------------------MYSQL数据库设置---------------------------------
# 你的MYSQL数据库IP，localhost是本机地址
MYSQL_HOST            ='localhost'
# 你的MYSQL数据库用户名
MYSQL_USER            ='root'
# 你的MYSQL数据库密码
MYSQL_PASSWORD        ='123456'


#--------------------------------预约设置---------------------------------

SUB_TIME              = "21:29:56"

# 每个用户每次抢座的间隔 s
SUB_SLEEP_TIME        = 0.7

# 如果预约失败，每个用户最大尝试 次数
SUB_MAX_ATTEMPT       = 5

# True预约明天座位 ， False预约今天座位
RESERVE_NEXT_DAY      =True

#--------------------------------检查设置---------------------------------
# 检查开始时间07:40:00
TIME_START_TIME   = "07:40:00"

# 检查结束时间22:05:00
TIME_END_TIME     = "22:05:00"

# 每个用户每次检查间隔 s
TIME_SLEEP_TIME   = 1

# 每个用户最大尝试次数
TIME_MAX_ATTEMPT  = 3

# 所有用户检查时间间隔 s
TIME_Check_TIME   = 60*5


#--------------------------------座位设置---------------------------------
#   [72, 8640, "南八楼801室"] 解释为
#   72个位置数量  room id是8640   名称南八楼801室

#     位置   id       名称
Room_data = [
      [72, 8640, "南八楼801室"]
    , [72, 8639, "南七楼701室"]
    , [72, 8637, "南六楼601室"]
    , [620, 8638, "南四楼401室"]
    , [138, 8641, "南三楼301室"]
    , [492, 8642, "南三楼302室"]
    , [248, 8650, "东附二楼"]
    , [124, 8649, "一楼大厅"]
    , [8, 8677, "北五楼508室"]
    , [8, 8676, "北五楼507室"]
    , [9, 8675, "北五楼506室"]
    , [48, 8674, "北五楼504室"]
    , [46, 8651, "北五楼503室"]
    , [58, 8830, "北四楼407室"]
    , [68, 8653, "北四楼405室"]
    , [180, 8652, "北四楼403室"]
    , [88, 8654, "北四楼401室"]
    , [54, 8829, "北三楼308室"]
    , [84, 8655, "北三楼307室"]
    , [80, 8685, "北三楼303室"]
    , [96, 8657, "北二楼205室"]
    , [24, 8658, "北二楼203室"]
    , [112, 8656, "北二楼201室"]
    , [120, 8661, "北一楼109室"]
    , [8, 8678, "北一楼108室"]
    , [24, 8679, "北一楼106室"]
    , [24, 8680, "北一楼105室"]
    , [36, 8682, "北一楼104室"]
    , [24, 8681, "北一楼103室"]
    , [28, 8659, "北一楼102室"]
    , [12, 8673, "一楼106室"]
    , [92, 8684, "二楼201室"]
    , [64, 8683, "二楼202室"]]




# ----------------------------------------静态数据(禁止修改)-------------------------------------------

# 状态表，状态信息对于关系，不能修改
status = {
    '-1': '违约',
    '0': '待履约',
    '1': '学习中',
    '2': '已履约',
    '3': '暂离中',
    '5': '被监督中',
    '7': '已取消',
    '8': '密码错误',
    '9': '等待更新',
}

